Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove
The serialization structure for AnalysisPositionMove.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove._NodeId
The identifier of the node.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove._PartId
The identifier of the part.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove._Type
The type of the position.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove._Move
The move.

Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove.ToStruct(Tekla.Structures.Analysis.AnalysisPosition,Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Vector)
DO NOT USE! For internal usage only!
position: The position.
partId: The part ID.
move: The move.